Revit 2026 API

# RailingCanReset Property

---

True if the railing can be reset, False otherwise.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanReset { get; }
```
```vb
Public ReadOnly Property CanReset As Boolean
	Get
```
```cpp
public:
property bool CanReset {
	bool get ();
}
```
```fsharp
member CanReset : bool with get
```

#### Property Value

Boolean

A Railing can be reset only if the railing was created in Revit later than version 9.1.

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace